Repository: OpenBikes/Website
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Where are you ?
fr: Où êtes-vous?

source: Departure time
fr: Heure de départ

source: Where do you want to go ?
fr: Quel est votre destination ?

source: is
fr: est

source: Made by students
fr: Fais par des étudiants

source: OpenBikes is a project powered by students in data science and business intelligence from the Université Paul Sabatier - Toulouse III
fr: OpenBikes est un projet porté par des étudiants en sciences de données et de business intelligence de l’Université Paul Sabatier - Toulouse III

source: Modern
fr: Moderne

source: Bike sharing is part of the transport ecosystem of many major cities. We want to make bike transport a breeze.
fr: Les vélos en libre-partage font partie de l’écosystème urbain dans le monde entier. Nous voulons rendre le transport en vélo un jeu d’enfant.

source: Resilient
fr: Robuste

source: Our system is built on open-source tools and state of the art methodologies.
fr: Notre système est construit avec des outils open-source et l’état de l’art des technologies requises.

source: Award winning
fr: Récompensé

source: Winner of <a href='https://www.data.gouv.fr/fr/dataconnexions-6'>DataConnexions 6</a>, a national open data competition.
fr: Lauréat de <a href='https://www.data.gouv.fr/fr/dataconnexions-6'>DataConnexions 6</a>, une compétition nationale sur l’Open Data.

source: Our team
fr: Notre équipe

source: Founder
fr: Fondateur

source: OpenBikes is an excellent opportunity for me to enhance my skills in mathematics and computer science. I get a real kick out of making accurate forecasts. I also enjoy adressing the algorithmic issues we have to face, for example dealing with data in real-time and managing a large noSQL database.
fr: OpenBikes est une excellente opportunité pour moi de me parfaire en mathématiques et en informatiques. Ca m’intéresse beaucoup de faire des bonnes prévisions. Je prend aussi de plaisir à résoudre les problèmes algorithmiques auxquels nous devons faire face, par exemple la récupération des données en temps réel et la gestion d’une grande base de donnée noSQL.

source: Junior Flask Programmer
fr: Programmeur Flask

source: OpenBikes is the first project where I am able to associate backend and frontend development. It's a fantastic opportunity to apply my knowledge in statistics and business intelligence. OpenBikes has also helped me familiarize myself with modern technologies such as MongoDB.
fr: OpenBikes est mon premier projet associant développement backend et frontend. C’est une superbe opportunité pour mettre en avant mes compétences en statistiques et en business intelligence. Ce projet m’a aussi permis de me familiariser avec des technologies dans l’air du temps tel que MongoDB.

source: They talk about us
fr: Ils parlent de nous

source: Follow us on
fr: Suivez nous sur

source: Our tools
fr: Nos outils

source: Our goals
fr: Nos objectifs

source: We wish for OpenBikes to become a reference for the visualization and the analysis of bike sharing services in cities from all across the world. For this we are building a reliable forecasting model in order to advise users on their trips across the city. We also want to understand user behavior in order to help cities manage their bike sharing service.
fr: Nous voulons que OpenBikes devienne une référence pour la visualisation et la prédiction de vélos en libre service, et cela dans des villes du monde entier. Pour cela nous continuons à améliorer notre système de prédiction et nous étudions d’autres moyens d’utiliser les données dont nous disposons. Nous voulons aussi utiliser notre savoir-faire pour aider les villes à gérer leurs parcs de vélos.

source: The data we collect from various APIs is tranformed into a single format. Because we got this data for free we believe that it's only normal to redistribute it for other developers. For the while our API is not limited and not require any key. Later on, when we will enable access to historical data, things may change.
fr: Les données que nous collectons des différentes API sont transformé en un format unique. Nous obtenons ces données gratuitement, nous pensons que c’est donc normal de les redistribuer pour d’autres développeurs. Pour le moment notre API n’est pas limité et ne requiert pas de clé. Plus tard, lorsque nous donnerons l’accès aux données historiques, cela pourrait changer.

source: City current state
fr: Etat actuel d’une ville

source: Returns the state of each station in the queried city. Just like the maps, this data is refreshed every minute or so. The data follows the GeoJSON standard format.
fr: Retourne l’état actuel de chaque station d’une ville. Ces données se mettent à jour en même temps que les cartes. Ces données suivent le format standard GeoJSON.

source: Returns a dictionary containing the list of stations of each city. The data is refreshed every day.
fr: Retourne un dictionnaire contenant la liste des stations de chaque ville, ces données sont rafraîchis tous les jours.

source: Providers
fr: Fournisseurs

source: Returns a dictionary containing the list of cities each bike sharing provider covers. The data is updated every time we add/remove a city.
fr: Retourne un dictionnaire contenant la liste des villes que dessert chaque opérateur. Ces données se mettent à jour dès que l’on ajoute/supprime une ville.

source: Countries &amp; cities
fr: Pays &amp; villes

source: Returns a dictionary containing the list of cities of each country. The data is updated every time we add/remove a city.
fr: Retourne un dictionnaire contenant la liste des villes de chaque pays. Ces données se mettent à jour dès que l’on ajoute/supprime une ville.

source: City centers
fr: Centres

source: Returns a dictionary containing the center position of each city. The format is [lat, lon].
fr: Retourne un dictionnaire contenant le centre de chaque ville. Le format est [lat, lon].

source: Names
fr: Noms

source: Returns a dictionary containing translations for the names used in the API.
fr: Retourne un dictionnaire contenant les traductions des noms employés dans l’API.

source: Predictions
fr: Prédictions

source: Returns a dictionary informing if a city has predictions enabled or not.
fr: Retourne un dictionnaire indiquant si les prédictions sont activées pour une ville ou pas.

source: Updates
fr: Mises à jours

source: Returns a dictionary that contains the last update time of a city.
fr: Retour un dictionnaire contenant la date de mise à jour de chaque ville.

source: Frequently Asked Questions
fr: Foire Aux Questions

source: Why is my city not on the main page?
fr: Pourquoi est-ce ma ville n’est pas sur la page d’accueil?

source: There are a lot of cities who provide bike sharing. However, not all of these cities have linked their bike hubs to a central computer, hence we do not have access to their data.
fr: Il y’a beaucoup de villes qui proposent des vélos en libre-service. Cependant, pas toutes ces villes ont reliés leurs stations de vélos à un ordinateur central, nous n’avons pas accès aux données de ces villes.

source: Why have you built OpenBikes when similar applications already exist?
fr: Pourquoi avoir créé OpenBikes alors que d’autres applications existent déjà?

source: We believe that we compare well to other applications because we are honest about the data we are using while they are not. For example, there have already been applications that have used the CityBikes API as a data provider. However, CityBikes doesn't include timestamps, which makes it impossible to be sure that their data is in real time or not.
fr: Nous pensons que nous sommes plus honnêtes que d’autres applications. Par exemple, de nombreuses autres applications utilisent les données fournies par l’API CityBikes, cependant celle-ci n’associe le temps à ses données, on ne peut donc pas être sûr que ces données soient en temps réel ou pas.

source: How do you predict the number of bikes/spaces at a station?
fr: Comment prédisez-vous le nombre de vélos/stations à l’avance?

source: We use a machine learning. We have had the best results with the Random Forest algorithm.
fr: Nous utilisons du machine learning. Nous obtenons de bons résultats avec l’algorithme du Random Forest.

source: Can you summarize how OpenBikes works under the hood?
fr: Pouvez-vous résumer comment OpenBikes fonctionne?

source: We have a program that collects data from different cities. When the data is collected it is transformed so that all our data is uniform regardless of where it comes from. We run our machine learning algorithm on all the data we have collected, we do this once a week. We then connect our predictions to the map.
fr: Nous avons écrit un programme qui récupère les données de différentes villes. Lorsque nous collectons des données, nous les transformons pour qu’elles aient toutes la même forme, quelque soit la ville. Ensuite, nous appliquons nos algorithmes d’apprentissage sur l’ensemble des données, nous le faisons une fois par semaine. Il s’agit alors de connecter nos prédictions aux cartes.

source: Why is the prediction button not on the map of each city?
fr: Pourquoi est-ce que le bouton de prédiction n’est pas sur la carte de chaque ville?

source: Quite often the data that we collect does not have associated timestamps, hence it's impossible to verify if the data is in real time or not. Without a timestamp we cannot run our prediction models. Some other applications use the current time as a timestamp but that leads to a lot of problems and imprecision.
fr: Très souvent les données que nous collectons sont incomplètes car le temps n’est pas indiqué dessus. Sans temps nous ne pouvons pas appliquer nos algorithmes d’apprentissage précisément. D’autres applications utilisent le temps actuel mais cela est très imprécis.

source: Can I help?
fr: Est-ce je peux aider?

source: Of course! We are merely students who do similar side projects during our spare time. The code for the application is available on GitHub, a lot of it is documented and you can send us a mail in case you have questions or suggestions.
fr: Bien sûr! Nous sommes seulement des étudiants qui travaillons sur des projets similaires durant notre temps libre. Le code de l’application est accessible sur GitHub, dont beaucoup est documenté. Vous pouvez aussi nous envoyer un mail si vous avez des questions ou des suggestions.

source: is the winner of
fr: est le lauréat de

source: a national open data competition (02/02/16)
fr: une compétition nationale d’Open Data (02/02/16)

source: Basic
fr: Informative

source: Light
fr: Lumineuse

source: Dark
fr: Sombre

source: Locate me
fr: Me localiser

source: Meters
fr: mètres

source: This is you!
fr: C’est vous!

source: Updated
fr: Mise à jour

source: Bikes >> Stands
fr: Vélos >> Places

source: Bikes > Stands
fr: Vélos > Places

source: Bikes = Stands
fr: Vélos = Places

source: Bikes < Stands
fr: Vélos < Places

source: Bikes << Stands
fr: Vélos << Places

source: bikes
fr: vélos

source: bike
fr: vélo

source: stands
fr: places

source: stand
fr: place

source: Closed
fr: Fermée

source: Something went wrong :-(
fr: Une erreur est survenue :(

source: Prediction - Choose an option
fr: Trouver le meilleur trajet

source: Drop a bike off
fr: Poser un vélo

source: Pick up a bike
fr: Prendre un vélo

source: Make a trip
fr: Faire un trajet

source: Close
fr: Fermer

source: Let us search for the best trip possible
fr: Trouver le meilleur trajet

source: OpenBikes is a website developed by students from
fr: OpenBikes est un site web développé par des étudiants de

source: Coordinates
fr: Coordonnées

source: MAPS
fr: CARTES

source: ABOUT
fr: INFORMATIONS

source: Language
fr: Langue

source: Maps - OpenBikes
fr: Cartes - OpenBikes

source: About - OpenBikes
fr: Informations - OpenBikes
